{
    "jobs": [
        {
            "id": "emNhTi1oOWxjQWlGTFN4MkFBQUFBQSUzRCUzRCUzQlNvZnR3YXJlJTIwZGV2ZWxvcGVyJTIwaW50ZXJuJTIwSXNyYWVsJTIwJTIwJTNC",
            "title": "Part-Time Software Engineering Intern, 2024",
            "company": "Google",
            "description": "Part-Time Software Engineering Intern, 2024share linkCopy linkemailEmail a friendcorporate_fareGoogleplaceTel Aviv, Israel; Haifa, Israelbar_chartIntern &amp; ApprenticeApplyshare linkCopy linkemailEmail a friendinfo_outlineXInfo Please complete your application before 27th October 2023. We encourage you to apply as early as possible as we review applications on a rolling basis.\nTo start the application process, you will need an updated CV or resume and a current unofficial or official transcript in English. Click on the “Apply” button on this page and provide the required materials in the appropriate sections (PDFs preferred):\n\n1. In the “Resume Section:” attach an updated CV or resume.\n2. In the “Education Section:” attach a current or recent unofficial or official transcript in English.\nUnder “Degree Status,” select “Now attending” to upload a transcript.\n\nPlease include your expected graduation date (month and year), and availability for the internship on your resume. The specific... team and project(s) will be determined based on your educational background, interest and skills.\nNote: By applying to this position you will have an opportunity to share your preferred working location from the following: Tel Aviv, Israel; Haifa, Israel.Please complete your application before 27th October 2023. We encourage you to apply as early as possible as we review applications on a rolling basis.To start the application process, you will need an updated CV or resume and a current unofficial or official transcript in English. Click on the “Apply” button on this page and provide the required materials in the appropriate sections (PDFs preferred):1. In the “Resume Section:” attach an updated CV or resume.2. In the “Education Section:” attach a current or recent unofficial or official transcript in English.Under “Degree Status,” select “Now attending” to upload a transcript.Please include your expected graduation date (month and year), and availability for the internship on your resume. The specific team and project(s) will be determined based on your educational background, interest and skills.Note: By applying to this position you will have an opportunity to share your preferred working location from the following: Tel Aviv, Israel; Haifa, Israel.Minimum qualifications:\nCurrently enrolled in a Bachelor's/Master’s degree in Computer Science or a related technical field, and in your penultimate year of study.\nExperience with Data Structures or Algorithms from university, an internship, open source hobby coding, or other practical experience.\nCoding experience in one of the following programming languages: C++, Java, Python, or Go.\nPreferred qualifications:\nReturning to your degree after completing the internship.\nInternship or work experience (e.g., research assistant, teaching assistant, personal projects, etc) with programming in either: C++, Java, Python, or Go.\nExperience with one or more of the following: web application development, Unix/Linux, mobile application development, distributed and parallel systems, machine learning, information retrieval, natural language processing, networking, developing large software systems, and/or security software development.\nInterest and ability to learn other coding languages as needed.\nAbout the jobOn this team, you will work on specific projects critical to Google’s needs. You will design, test, deploy, and maintain software solutions as you, and our fast-paced business evolve during your internship.This internship is intended for students in their penultimate year of an accredited full-time degree program in the EMEA region who will be returning to their degree program after the completion of the internship. Participation in the internship program requires that you are located in the specific country for this role for the duration of the internship program. Interns will be required to be available to work part-time (minimum 2 days a week) alongside your studies for a minimum of 26 weeks over the Summer 2024 for the duration of the program.Google is and always will be an engineering company. We hire people with a broad set of technical skills who are ready to address some of technology's greatest challenges and make an impact on millions, if not billions, of users. At Google, engineers not only revolutionize search, they routinely work on massive scalability and storage solutions, large-scale applications and entirely new platforms for developers around the world. From Google Ads to Chrome, Android to YouTube, Social to Local, Google engineers are changing the world one technological achievement after another.Responsibilities\nResearch, conceive and develop software applications to extend and improve on Google's product offering.\nContribute to a wide variety of projects using natural language processing, artificial intelligence, data compression, machine learning, and search technologies.\nCollaborate on scalability issues involving access to data and information.\nUtilize exposure to large-scale production software troubleshooting.\nHelp maintain mission critical services.\nInformation collected and processed as part of your Google Careers profile, and any job applications you choose to submit is subject to Google's Applicant and Candidate Privacy Policy.Google is proud to be an equal opportunity workplace and is an affirmative action employer. We are committed to equal employment opportunity regardless of race, color, ancestry, religion, sex, national origin, sexual orientation, age, citizenship, marital status, disability, gender identity or Veteran status. We also consider qualified applicants regardless of criminal histories, consistent with legal requirements. See also Google's EEO Policy and Know your rights: workplace discrimination is illegal. If you have a need that requires accommodation, please let us know by completing our Accommodations for Applicants form.To all recruitment agencies: Google does not accept agency resumes. Please do not forward resumes to our jobs alias, Google employees or any other organization location. Google is not responsible for any fees related to unsolicited resumes.At Google, we're committed to building a workforce that is more representative of the users we serve and creating a culture where everyone feels like they belong. To learn more about our diversity, equity, inclusion commitments and how we're building belonging, please visit our Belonging page for more information.We welcome and encourage people who are expecting and/or parents-to-be to apply to this or any other role at Google.Google is a global company and, in order to facilitate efficient collaboration and communication globally, English proficiency is a requirement for all roles",
            "image": "",
            "location": "Tel Aviv-Yafo",
            "employmentType": "Full-time, Part-time, and Internship",
            "datePosted": "",
            "salaryRange": "",
            "jobProviders": [
                {
                    "jobProvider": "Joinrs",
                    "url": "https://www.joinrs.com/de/job-offers/18235/?utm_campaign=google_jobs_apply&utm_source=google_jobs_apply&utm_medium=organic"
                }
            ]
        },
        {
            "id": "dGhNYUh3UEJjNVpjc3J3VUFBQUFBQSUzRCUzRCUzQlNvZnR3YXJlJTIwZGV2ZWxvcGVyJTIwaW50ZXJuJTIwSXNyYWVsJTIwJTIwJTNC",
            "title": "Software Dev Engineer Intern",
            "company": "Amazon",
            "description": "JOB ID: 2238926\n\nJob summary\nWe’re on the lookout for the curious, those who think big and want to define the world of tomorrow. At Amazon, you will grow into the high impact, visionary person you know you’re ready to be. Every day will be filled with exciting new challenges, developing new skills, and achieving personal growth.\n\nHow often can you say that your work changes the world? At Amazon, you’ll say it often. Join us and define tomorrow.\n\nIf you’re insatiably curious and always want to learn more, then you’ve come to the right place.\nWith us, you’ll get good at making fast decisions, taking calculated risks and fearlessly chasing excellence.\n\nAs an intern, you will be matched to a manager and a mentor. You will have the opportunity to impact the evolution of Amazon technology as well as lead mission critical projects early in your career. Your design, code, and raw smarts will contribute to solving some of the most complex technical challenges in the areas of distributed... systems, data mining, automation, optimization, scalability, and security – just to name a few.\n\nKey job responsibilities\n• Collaborate with experienced cross-disciplinary Amazonians to conceive, design, and bring to market innovative products and services.\n• Design and build innovative technologies in a large distributed computing environment and help lead fundamental changes in the industry.\n• Create solutions to run predictions on distributed systems with exposure to innovative technologies at incredible scale and speed.\n• Build distributed storage, index, and query systems that are scalable, fault-tolerant, low cost, and easy to manage/use.\n• Ability to design and code the right solutions starting with broadly defined problems.\n• Work in an agile environment to deliver high quality software.\n\nApplications are reviewed on a rolling basis. For an update on your status, or to confirm your application was submitted successfully, please login to your candidate portal. Please note that Amazon works with a high volume of applicants. We appreciate your patience as we review applications for future Amazonians!\n\nPlease include a grade sheet/academic transcript (in English) along with your CV in a single PDF when submitting your application.\n\nBASIC QUALIFICATIONS\n• Currently enrolled in a Bachelor’s or Master’s Degree in Computer Science, Computer Engineering, or related fields at time of application\n• Although no specific programming language is required – you should be familiar with the syntax of languages such as Java, C/C++, or Python\n• Knowledge of Computer Science fundamentals such as object-oriented design, algorithm design, data structures, problem solving and complexity analysis\n\nPREFERRED QUALIFICATIONS\n• Previous technical internship(s) if applicable\n• Experience with distributed, multi-tiered systems, algorithms, and relational databases\n• Experience in optimization mathematics such as linear programming and nonlinear optimization\n• Ability to effectively articulate technical challenges and solutions\n• Adept at handling ambiguous or undefined problems as well as ability to think abstractly",
            "image": "https://encrypted-tbn0.gstatic.com/images?q=tbn:ANd9GcQTifI4qApXZgV_Uz8tSiGZXIaES6fcOxT554DO&s=0",
            "location": "Tel Aviv District",
            "employmentType": "Internship",
            "datePosted": "",
            "salaryRange": "",
            "jobProviders": [
                {
                    "jobProvider": "CS FOR ALL",
                    "url": "https://csforall.in/job/software-dev-engineer-intern-2238926/?utm_campaign=google_jobs_apply&utm_source=google_jobs_apply&utm_medium=organic"
                }
            ]
        },
        {
            "id": "UGM0b1B2UmdhU2xUanpOakFBQUFBQSUzRCUzRCUzQlNvZnR3YXJlJTIwZGV2ZWxvcGVyJTIwaW50ZXJuJTIwSXNyYWVsJTIwJTIwJTNC",
            "title": "Career Opportunities: Summer 2025 Intern - Software Development - Data...",
            "company": "Ansys",
            "description": "This a Full Remote job, the offer is available from: North America, Europe, Asia\n\nRequisition #: 14987\n\nOur Mission: Powering Innovation That Drives Human Advancement\n\nWhen visionary companies need to know how their world-changing ideas will perform, they close the gap between design and reality with Ansys simulation. For more than 50 years, Ansys software has enabled innovators across industries to push boundaries by using the predictive power of simulation. From sustainable transportation to advanced semiconductors, from satellite systems to life-saving medical devices, the next great leaps in human advancement will be powered by Ansys.\n\nInnovate With Ansys, Power Your Career.\n\nAs an Electronics Desktop Software Development intern, you will help develop our industry-leading simulation software while gaining real experience in your field of study. You will work on a variety of impactful projects to help maintain, advance, and accelerate Ansys products.\n\nIn this internship, you will... support our Electronics Semiconductor and Optical Business Unit (ESOBU) with software development and data science for Ansys Electronics Desktop. This is a 40-hour per week paid position for Summer 2025 beginning May 2025 and concluding August 2025. This position is a fully remote opportunity.\n\nRESPONSIBILITIES\n• Make improvements to the Ansys Product Improvement Program analytics system.\n• Develop prototypes or test new solution strategies or algorithms.\n• Investigate defects in existing code.\n• Analyze results and communicate findings using visualization software.\n\nMINIMUM QUALIFICATIONS\n• Pursuing a Master’s degree in Computer Science with a GPA of 3.0 or higher.\n• Currently enrolled in a full-time degree program and returning to university after the completion of the internship program.\n• Experience with Python and SQL.\n• Solid background in algorithms and data structures.\n• Strong analytical skills and willingness to learn.\n• Some background in data science and/or machine learning.\n\nPREFERRED QUALIFICATIONS\n• Experience with Azure Databricks, Spark, Power BI.\n• Experience with C++ is nice to have.\n• Experience with multi-threaded or parallel programming is nice to have.\n• Experience with Go (language) is nice to have.\n\nAt Ansys, we know that changing the world takes vision, skill, and each other. We fuel new ideas, build relationships, and help each other realize our greatest potential. We are ONE Ansys. We operate on three key components: the commitments to our stakeholders, the behaviors of how we work together, and the actions of how we deliver results. Together as ONE Ansys, we are powering innovation that drives human advancement.\n\n \n\nOur Commitments:\n• Amaze with innovative products and solutions\n• Make our customers incredibly successful\n• Act with integrity\n• Ensure employees thrive and shareholders prosper\n\nOur Values:\n• Adaptability: Be open, welcome what's next\n• Courage: Be courageous, move forward passionately\n• Generosity: Be generous, share, listen, serve\n• Authenticity: Be you, make us stronger\n\nOur Actions:\n• We commit to audacious goals\n• We work seamlessly as a team\n• We demonstrate mastery\n• We deliver outstanding results\n\nINCLUSION IS AT OUR CORE\n\nWe believe diverse thinking leads to better outcomes. We are committed to creating and nurturing a workplace that fuels this by welcoming people, no matter their background, identity, or experience, to a workplace where they are valued and where diversity, inclusion, equity, and belonging thrive.\n\nWELCOME WHAT’S NEXT IN YOUR CAREER AT ANSYS\n\nAt Ansys, you will find yourself among the sharpest minds and most visionary leaders across the globe. Collectively we strive to change the world with innovative technology and transformational solutions. With a prestigious reputation in working with well-known, world-class companies, standards at Ansys are high — met by those willing to rise to the occasion and meet those challenges head on. Our team is passionate about pushing the limits of world-class simulation technology, empowering our customers to turn their design concepts into successful, innovative products faster and at a lower cost.\n\n \n\nAt Ansys, it’s about the learning, the discovery, and the collaboration. It’s about the “what’s next” as much as the “mission accomplished.” And it’s about the melding of disciplined intellect with strategic direction and results that have, can, and do impact real people in real ways. All this is forged within a working environment built on respect, autonomy, and ethics.\n\n \n\nCREATING A PLACE WE’RE PROUD TO BE \n\nAnsys is an S&amp;P 500 company and a member of the NASDAQ-100. We are proud to have been recognized for the following more recent awards, although our list goes on: Newsweek’s Most Loved Workplace globally and in the U.S., Gold Stevie Award Winner, America’s Most Responsible Companies, Fast Company World Changing Ideas, Great Place to Work Certified (Belgium, China, Greece, France, India, Japan, Korea, Spain, Sweden, Taiwan, and U.K.).\n\n \n\nFor more information, please visit us at www.ansys.com\n\n \n\nAnsys is an Equal Opportunity Employer. All qualified applicants will receive consideration for employment without regard to race, color, religion, sex, sexual orientation, gender identity, national origin, disability, veteran status, and other protected characteristics.\n\n \n\nAnsys does not accept unsolicited referrals for vacancies, and any unsolicited referral will become the property of Ansys. Upon hire, no fee will be owed to the agency, person, or entity.\n\nThis offer from \"Ansys\" has been enriched by Jobgether.com and got a 84% flex score",
            "image": "https://encrypted-tbn0.gstatic.com/images?q=tbn:ANd9GcRDEIZ8ZOZ1-B46WhGKP9oZ7aQyGrrEhFspWyJ0&s=0",
            "location": "Anywhere",
            "employmentType": "Full-time and Internship",
            "datePosted": "22 days ago",
            "salaryRange": "",
            "jobProviders": [
                {
                    "jobProvider": "Jobgether",
                    "url": "https://jobgether.com/offer/66fdc0737cba91ad3dc16d88-career-opportunities-summer-2025-intern---software-development---data-science-ms-14987?utm_campaign=google_jobs_apply&utm_source=google_jobs_apply&utm_medium=organic"
                }
            ]
        },
        {
            "id": "TGtNY3NpaE5DSWhWV2JTTUFBQUFBQSUzRCUzRCUzQlNvZnR3YXJlJTIwZGV2ZWxvcGVyJTIwaW50ZXJuJTIwSXNyYWVsJTIwJTIwJTNC",
            "title": "Senior Software Engineer",
            "company": "Testlio",
            "description": "This a Full Remote job, the offer is available from: EMEA\n\nLocation: Europe, Middle East, and Africa including Central and Eastern Europe, the Baltics, the Balkans, Ireland, Italy, Portugal, Spain, Etc. Due to our compensation strategy, we are not considering applicants from high-cost-of-living locations such as Benelux, DACH, France, Nordics, and the UK.\n\nAbout the job\n\nTestlio is the originator of fused software testing, a unique approach to testing that combines humans and machines to help digital innovators deliver quality products at scale. In any location. On any device. In any language. Via any payment method. The company is distributed by design, with full-time people worldwide and part-time freelancers in over 150 countries. Clients include Amazon, Athenahealth, Microsoft, the NBA, Netflix, PayPal, Uber, Wayfair, and many more. Collectively, they have awarded us an industry-leading 4.7 G2 rating. To learn more, visit www.testlio.com.\n\nWe are hiring a Senior Software Engineer... to help us deliver solutions that harness data &amp; the latest AI advancements to generate measurable business impacts, ensuring our leadership in quality software testing services.\n\nWhy you will love this job?\n• Shape the future of testing with AI: Be at the forefront of innovation, building solutions that harness the power of AI to automate tasks, generate valuable insights, and drive testing efficiency.\n• Make a tangible impact: Your work directly influences the success of our clients and the quality of their digital products. See your contributions translated into real-world improvements that benefit millions of users.\n\nWhy you will love being a part of Testlio?\n• A true sense of belonging: the TestLion Pride is a global community of like-minded people who live Testlio’s six values every day.\n• Growth through learning: knowledge exchange and learning are central to working at Testlio. You’ll find that motivated, experienced TestLions with diverse backgrounds can always introduce you to new perspectives.\n• Enable human possibilities: your work at Testlio has a larger purpose. As a TestLion you will not only help our customers create well-built digital experiences for their users, but also create opportunities for Testlio's freelance network, and support social impact programs like Ignite.\n• Freedom to roam: Testlio is a global company that embraces flexibility. You'll have room to work wherever within your region's main time zones. We also want to make sure you can take time off from work to rest. We honor national holidays in your home nation and provide a generous number of days off, including personal wellness days.\n• Great culture: Testlio’s is female-founded and is 46% women. Our purpose, vision, and values help drive positive mindsets and behaviors. People like working with each other and love the global scale of the company. We move fast and empower people on the frontlines to make decisions and own initiatives.\n• Winning business: Testlio is growing, profitable, and cash-strong. We are leading our industry with exceptional clients who provide us with a high NPS score and a 4.7 rating on G2. Our business model is global, enterprise, and subscription-based, with 85%+ of our revenue recurring.\n\nWhat would your day look like?\n• Work in a team environment: contribute to team tasks and goals; follow team processes (Scrum) and rituals\n• Work closely with designers and business stakeholders to bring the best solutions to end users\n• Do technical design of full stack system components that fit into long-term architecture, addressing all the functional and non-functional requirements\n• Build and implement performant, scalable, and quality products, in an iterative approach\n• Write quality code, push for high standards, conduct code reviews\n• Write automated tests and conduct manual testing of changes\n• Lead debugging and root cause analysis of complex problems, offer solutions\n• Help and mentor other team members, proactively share and document knowledge\n• Carry out rotation-based on-call duties for owned services and functionalities\n\nWhat you need to succeed?\n\nTechnical Skills\n• A university degree in Computer Science, Software Engineering or equivalent\n• 5-10 years of full-stack coding experience, building modern cloud-native applications\n• Strong affinity with our tech stack of React, TypeScript, NodeJS, Graphql, PHP, MySQL, AWS, Kafka\n• In-depth knowledge of core browser concepts and responsive web design\n• Practical knowledge of modern API architecture, microservices, and event-driven design\n• Experience in writing automated tests is a strong plus\n• AI/ML experience is a plus\n• AWS Solutions Architect certification is a plus\n\nHuman Skills\n• Fluency in English, with excellent written and verbal communication skills.\n• Organized and thorough with a commitment to quality.\n• Results-oriented, with data-driven decision-making and a focus on delivering impactful outcomes.\n• Preference for a remote working environment, collaborating closely with peers within the EMEA timezone.\n\nWhat is the Candidate Consideration Process\n\nWe seek to hire individuals who will be excited about their role and have the potential to grow with Testlio. Since we are 100% distributed, it’s important for us to provide you the opportunity to meet with multiple stakeholders throughout the organization. This gives you insight into the role and a chance to interact with future peers. Our interview process can take about 4 to 6 weeks to complete as we want to ensure a great fit for everyone.\n• Application\n• Hiring manager interview\n• Multipart TestGorilla assessment\n• Reference checks\n• At home Coding exercise with a follow-up demo &amp; discussion\n• 2-4 stakeholder interviews\n• Offer and background checks\n\nDiversity and Inclusion\n\nTestlio is an equal-opportunity employer deeply committed to creating an inclusive environment for people of all backgrounds and identities. We are female-founded and 46% of our team identifies as women. See the DEI section of our website for more information.\n\nThis offer from \"Testlio\" has been enriched by Jobgether.com and got a 85% flex score",
            "image": "https://encrypted-tbn0.gstatic.com/images?q=tbn:ANd9GcShBXMBGI4xRUyaHVChC8H-tGxyTDUlutB-EdS9&s=0",
            "location": "Anywhere",
            "employmentType": "Full-time and Part-time",
            "datePosted": "",
            "salaryRange": "",
            "jobProviders": [
                {
                    "jobProvider": "Jobgether",
                    "url": "https://jobgether.com/offer/664e01c02b22b6bbf24baafe-senior-software-engineer?utm_campaign=google_jobs_apply&utm_source=google_jobs_apply&utm_medium=organic"
                }
            ]
        },
        {
            "id": "OHhIQVRVbGlPaThLNmloZUFBQUFBQSUzRCUzRCUzQlNvZnR3YXJlJTIwZGV2ZWxvcGVyJTIwaW50ZXJuJTIwSXNyYWVsJTIwJTIwJTNC",
            "title": "Tools Developer For Hardware Verification – Student Position",
            "company": "IBM",
            "description": "Introduction\nAt IBM, work is more than a job - it's a calling: To build. To design. To code. To consult. To think along with clients and sell. To make markets. To invent. To collaborate. Not just to do something better, but to attempt things you've never thought possible. Are you ready to lead in this new era of technology and solve some of the world's most challenging problems? If so, lets talk.\n\nYour Role and Responsibilities\nWe are looking for a strong software engineer student to join a leading tool development team in IBM with two years to graduation.\nThe team develops automatic test generator tools used for processor verification during the design phase.\nOur technology is at the backbone of IBM's processors development effort, including embedded processors, servers, and supercomputers.\nThe position requires the ability to understand, design, and develop complex C++ software.\n\nRequired Technical and Professional Expertise\n- A strong computer science student (with a horizon of 2... years to graduation)\n- Good familiarity with OOP (e.g., C++, JAVA)\n\n- Motivated, self-directed, and able to work independently in Hebrew &amp; English fluent speaking and writing\n- Please attach your full grade sheet to the application.\n\nPreferred Technical and Professional Expertise\n- Familiarity with Linux environment and Python\n- Knowledge of computer architectures",
            "image": "https://encrypted-tbn0.gstatic.com/images?q=tbn:ANd9GcQORF7mBhAVXWaRFsrtceplv5CCggAYyLmnJX1P&s=0",
            "location": "Haifa",
            "employmentType": "Part-time",
            "datePosted": "",
            "salaryRange": "",
            "jobProviders": [
                {
                    "jobProvider": "Define Your Career With IBM | IBM Careers - IBM",
                    "url": "https://careers.ibm.com/fr-ca/job-details-fr-ca/20779864/tools-developer-for-hardware-verification-student-position-haifa-il/?utm_campaign=google_jobs_apply&utm_source=google_jobs_apply&utm_medium=organic"
                },
                {
                    "jobProvider": "Indeed",
                    "url": "https://il.indeed.com/viewjob?jk=c7cddb8d4619aae0&utm_campaign=google_jobs_apply&utm_source=google_jobs_apply&utm_medium=organic"
                },
                {
                    "jobProvider": "Krb-Sjobs.brassring.com",
                    "url": "https://krb-sjobs.brassring.com/TGnewUI/Search/home/HomeWithPreLoad?partnerid=26059&siteid=5016&PageType=JobDetails&jobid=751704&utm_campaign=google_jobs_apply&utm_source=google_jobs_apply&utm_medium=organic"
                },
                {
                    "jobProvider": "LinkedIn",
                    "url": "https://il.linkedin.com/jobs/view/tools-developer-for-hardware-verification-%E2%80%93-student-position-at-ibm-4024866774?utm_campaign=google_jobs_apply&utm_source=google_jobs_apply&utm_medium=organic"
                },
                {
                    "jobProvider": "Talentify",
                    "url": "https://www.talentify.io/job/tools-developer-for-hardware-verification-student-position-haifa-hefa-ibm-717522br?utm_campaign=google_jobs_apply&utm_source=google_jobs_apply&utm_medium=organic"
                }
            ]
        },
        {
            "id": "RE9ZRW03ZS1jbG5Zb1NYa0FBQUFBQSUzRCUzRCUzQlNvZnR3YXJlJTIwZGV2ZWxvcGVyJTIwaW50ZXJuJTIwSXNyYWVsJTIwJTIwJTNC",
            "title": "Intern Data Scientist",
            "company": "PayPal",
            "description": "The Company\n\nPayPal has been revolutionizing commerce globally for more than 25 years. Creating innovative experiences that make moving money, selling, and shopping simple, personalized, and secure, PayPal empowers consumers and businesses in approximately 200 markets to join and thrive in the global economy.\n\nWe operate a global, two-sided network at scale that connects hundreds of millions of merchants and consumers. We help merchants and consumers connect, transact, and complete payments, whether they are online or in person. PayPal is more than a connection to third-party payment networks. We provide proprietary payment solutions accepted by merchants that enable the completion of payments on our platform on behalf of our customers.\n\nWe offer our customers the flexibility to use their accounts to purchase and receive payments for goods and services, as well as the ability to transfer and withdraw funds. We enable consumers to exchange funds more safely with merchants using a... variety of funding sources, which may include a bank account, a PayPal or Venmo account balance, PayPal and Venmo branded credit products, a credit card, a debit card, certain cryptocurrencies, or other stored value products such as gift cards, and eligible credit card rewards. Our PayPal, Venmo, and Xoom products also make it safer and simpler for friends and family to transfer funds to each other. We offer merchants an end-to-end payments solution that provides authorization and settlement capabilities, as well as instant access to funds and payouts. We also help merchants connect with their customers, process exchanges and returns, and manage risk. We enable consumers to engage in cross-border shopping and merchants to extend their global reach while reducing the complexity and friction involved in enabling cross-border trade.\n\nOur beliefs are the foundation for how we conduct business every day. We live each day guided by our core values of Inclusion, Innovation, Collaboration, and Wellness. Together, our values ensure that we work together as one global team with our customers at the center of everything we do – and they push us to ensure we take care of ourselves, each other, and our communities.\n\nJob Description Summary:\nGlobal Analytics and Data Science team seeks a Data Science Intern (student) to deliver data science projects in a complex business environment. You will collaborate with product managers, engineers, and peer ML scientists, leveraging PayPal’s endless amount of data to deliver end-to-end Data Science solutions.\nThe position is open to students from all schools, with at least one year remaining before graduation\n\nMeet our team\nPayPal’s Global Analytics and Data Sciences (GADS) team is responsible for developing and enhancing machine learning and data mining capabilities, which are key in PayPal’s data-driven decisions. Our team delivers state-of-the-art solutions, leveraging advanced AI/ML algorithms, including Gen-AI and NLP.\n\nJob Description:\n\nYour way to impact\n\nAs a Data Science Intern, you will work on multiple data science projects by performing analytical research, from data cleaning through feature engineering to model development and deployment. In this position, you will learn a lot about data science, analytics, and PayPal as a business. We seek a highly motivated team player with solid technical skills, strong interpersonal skills, business acumen, and a passion for data.\n\nYour day-to-day\n\nIn your day-to-day role, you will be responsible for developing data solutions and maintaining existing ones. You will participate actively in a scrum team that focuses on delivering similar projects. You will need to balance between code writing, team meetings, and side-by-side work with your colleagues and partners.\n\nWhat do you need to bring-\n• B.Sc / MS.c student (with one year left minimum) in computer science/math/engineering/physics/statistics or related technical field\n• Availability for at least 60% position\n• Experience working with big data\n• Background in Python and SQL, and familiarity with relevant ML packages\n• Great analytical skills and data orientation\n• Excellent English verbal and written communication skills\n• *We know the confidence gap and imposter syndrome can get in the way of meeting spectacular candidates. Please don't hesitate to apply.\n\nAdditional Job Description:\n\nSubsidiary:\nPayPal\n\nTravel Percent:\n0\n\nFor the majority of employees, PayPal's balanced hybrid work model offers 3 days in the office for effective in-person collaboration and 2 days at your choice of either the PayPal office or your home workspace, ensuring that you equally have the benefits and conveniences of both locations.\n\nOur Benefits:\n\nAt PayPal, we’re committed to building an equitable and inclusive global economy. And we can’t do this without our most important asset—you. That’s why we offer benefits to help you thrive in every stage of life. We champion your financial, physical, and mental health by offering valuable benefits and resources to help you care for the whole you.\n\nWe have great benefits including a flexible work environment, employee shares options, health and life insurance and more. To learn more about our benefits please visit https://www.paypalbenefits.com.\n\nWho We Are:\n\nClick Here to learn more about our culture and community.\n\nCommitment to Diversity and Inclusion\n\nPayPal provides equal employment opportunity (EEO) to all persons regardless of age, color, national origin, citizenship status, physical or mental disability, race, religion, creed, gender, sex, pregnancy, sexual orientation, gender identity and/or expression, genetic information, marital status, status with regard to public assistance, veteran status, or any other characteristic protected by federal, state, or local law. In addition, PayPal will provide reasonable accommodations for qualified individuals with disabilities. If you are unable to submit an application because of incompatible assistive technology or a disability, please contact us at talentaccommodations@paypal.com.\n\nBelonging at PayPal:\n\nOur employees are central to advancing our mission, and we strive to create an environment where everyone can do their best work with a sense of purpose and belonging. Belonging at PayPal means creating a workplace with a sense of acceptance and security where all employees feel included and valued. We are proud to have a diverse workforce reflective of the merchants, consumers, and communities that we serve, and we continue to take tangible actions to cultivate inclusivity and belonging at PayPal.\n\nAny general requests for consideration of your skills, please Join our Talent Community.\n\nWe know the confidence gap and imposter syndrome can get in the way of meeting spectacular candidates. Please don’t hesitate to apply",
            "image": "",
            "location": "Tel Aviv-Yafo",
            "employmentType": "Full-time and Internship",
            "datePosted": "16 days ago",
            "salaryRange": "",
            "jobProviders": [
                {
                    "jobProvider": "PayPal - Eightfold.ai",
                    "url": "https://paypal.eightfold.ai/careers/?pid=274903122945&location=india&domain=paypal.com&utm_campaign=google_jobs_apply&utm_source=google_jobs_apply&utm_medium=organic"
                },
                {
                    "jobProvider": "Indeed",
                    "url": "https://il.indeed.com/viewjob?jk=743b4b76bb152530&utm_campaign=google_jobs_apply&utm_source=google_jobs_apply&utm_medium=organic"
                },
                {
                    "jobProvider": "LinkedIn",
                    "url": "https://il.linkedin.com/jobs/view/intern-data-scientist-at-paypal-4034164477?utm_campaign=google_jobs_apply&utm_source=google_jobs_apply&utm_medium=organic"
                },
                {
                    "jobProvider": "Glassdoor",
                    "url": "https://www.glassdoor.co.uk/job-listing/intern-data-scientist-paypal-JV_IC2421096_KO0,21_KE22,28.htm?jl=1009462379595&utm_campaign=google_jobs_apply&utm_source=google_jobs_apply&utm_medium=organic"
                },
                {
                    "jobProvider": "Companies | LHH Job Board - LHH Israel",
                    "url": "https://jobs.lhh.co.il/jobs?q=AI+Security+Development+Intern&utm_campaign=google_jobs_apply&utm_source=google_jobs_apply&utm_medium=organic"
                }
            ]
        }
    ],
    "index": 1,
    "jobCount": 6,
    "hasError": false,
    "errors": []
}