{
    "jobs": [
        {
            "id": "Vnp5VmN6SHpzU3d0akN3cUFBQUFBQSUzRCUzRCUzQlN0dWRlbnQlMjBJc3JhZWwlMjAlMjAlM0I=",
            "title": "Customer Support Specialist - Student Position",
            "company": "Rapyd",
            "description": "Rapyd has unified payments, payouts and fintech on one worldwide platform, and we’re assembling the world’s best team to liberate global commerce. With offices in Tel Aviv, Amsterdam, Singapore, Iceland, London, Dubai, Hong Kong, and the U.S., the opportunities at Rapyd are limitless.\n\nWe believe in straight talk, quick decisions, strong execution and elegant solutions. Rapyd is where hard work pays off and careers take off. Join us and let’s build the future of fintech together\n\n.\nGet the tools to grow globally at www.rapyd.net. Follow: Blog, Insta, LinkedIn, Twitt\n\ner\nAs a Customer Support Specialist, you will be responsible f\n• or:Providing direct technical and operational support to customers via phone, email and c\n• hatResponding to customer inquiries and resolving customer issues in a timely and professional man\n• nerSupport both internal teams and customers by responding to events and various technical issues in real-t\n• imeIdentifying and escalating more complex issues to... higher-level technical support or engineering te\n• amsDirect communication with worldwide partn\n• ersTracking the events until problems are resolved, contacting the relevant factors in the organization as nee\n\nded\nRequireme\n• nts:At least 3 semesters (1.5 years) left until gradua\n• tionAt least 1 year experience of working in a customer-oriented environ\n• mentExcellent written and verbal communication skills in Eng\n• lishExcellent troubleshooting skills and ability to work well under pres\n• sureBeing able to work in a fast-paced environment, multitask and meet tight deadl\n• inesCommitment is required for a minimum of 3 shifts per week, including one night shift, and the availability to work 24/7 shifts, including weekends, nights, and holi\n• daysKnowledge in working with APIs, HTTP requests, etc. - Advan\n• tageExperience in Customer Support Similar positions - Advan\n\ntage",
            "image": "https://encrypted-tbn0.gstatic.com/images?q=tbn:ANd9GcT20gvEGCZFRCsQsqTFQAImtCOq5E8en9StdBoZ&s=0",
            "location": "Tel Aviv-Yafo, Israel",
            "employmentType": "Part-time",
            "datePosted": "1 day ago",
            "salaryRange": "",
            "jobProviders": [
                {
                    "jobProvider": "LinkedIn",
                    "url": "https://il.linkedin.com/jobs/view/customer-support-specialist-student-position-at-rapyd-4025536119?utm_campaign=google_jobs_apply&utm_source=google_jobs_apply&utm_medium=organic"
                },
                {
                    "jobProvider": "Superdev",
                    "url": "https://superdev.co.il/jobs/2141875719-customer-support-specialist---student-position-rapyd?utm_campaign=google_jobs_apply&utm_source=google_jobs_apply&utm_medium=organic"
                }
            ]
        },
        {
            "id": "blNzbDc5eWJpV2FCR3hOWkFBQUFBQSUzRCUzRCUzQlN0dWRlbnQlMjBJc3JhZWwlMjAlMjAlM0I=",
            "title": "ML Student",
            "company": "Samsung Research and Development Center Israel",
            "description": "Description\n\nJoin the cutting-edge team at Samsung R&amp;D Center as we embark on shaping the future of technology today. Beyond merely envisioning the horizon, we are actively pushing boundaries in various key areas of innovation. Samsung is committed to pioneering continuous advancements, delivering value to society, and fostering an environment where our employees can fully unleash their talents, creativity, and passion. Join us in building the tomorrow we envision,\n\nThe Group\n\nSamsung Semiconductor Israel’s Computer Vision team is responsible for developing and productizing highly challenging, cutting edge, computer vision and machine learning algorithms for Samsung’s next generation products. Our team is making a significant impact on technology that reaches hundreds of millions of users around the world.\n\nWhat will you do?\n\nTake part in project of Building a proof of concept for a new camera feature with image generation capabilities for Samsung phones.\n• Explore recent computer... vision (CV)/machine learning (ML) technologies\n• Collaborate with top notch CV and ML researchers\n• Define, implement, test, train and evaluate neural network schemes\n• Deal with HW and SW implementation constraints\n• Define and implement algorithmic evaluation protocols\n\nRequirements\n• MSc/PhD student (or exceptional BSc students) of CS/EE/Math or related field\n• ML and NN Knowledge and experience\n• Great coding skills with Python experience\n• Capability to quickly grasp new fields and technologies.\n• Great interpersonal skills",
            "image": "",
            "location": "Tel Aviv-Yafo, Israel",
            "employmentType": "Full-time",
            "datePosted": "5 days ago",
            "salaryRange": "",
            "jobProviders": [
                {
                    "jobProvider": "Comeet",
                    "url": "https://www.comeet.com/jobs/samsung/D4.005/ml-student/E6.A48?utm_campaign=google_jobs_apply&utm_source=google_jobs_apply&utm_medium=organic"
                }
            ]
        },
        {
            "id": "UmhTbGtlWDB4d3d3aEJMckFBQUFBQSUzRCUzRCUzQlN0dWRlbnQlMjBJc3JhZWwlMjAlMjAlM0I=",
            "title": "Mechanical Engineering Student",
            "company": "Medtronic",
            "description": "At Medtronic you can begin a life-long career of exploration and innovation, while helping champion healthcare access and equity for all. You’ll lead with purpose, breaking down barriers to innovation in a more connected, compassionate world.\n\nA Day in the Life\n\nResponsibilities may include the following and other duties may be assigned.\n• Be a part of a R&amp;D mechanical engineering team that is responsible for developing surgical platforms.\n• Design, run and document design supporting tests according to company standards.\n• Support R&amp;D lab activities such as: System maintenance (including 3D printers), troubleshooting and hands on support to engineers.\n• Write technical documentation – component specifications, test results etc.\n• Support engineers in design projects.\n• Support different groups on-site requiring CAD or other assistance.\n• Technical data analysis, dashboards creation and support data-driven decision making.\n• Work physically from our offices in Caesarea.\n\nMust Haves\n•... Student for a bachelor's degree in mechanical engineering with at least 3 semesters remaining.\n• Availability for at least 2 full working days (at the Caesarea office) during semester (optionally more, from home). Total of 3-5 work days during summer break.\n• Strong English written and verbal communication skills – most of the communication, and all documentation, is written in English, including occasional online meetings with US colleagues.\n• In-depth experience with Microsoft office tools: Word, PowerPoint, Excel.\n• Self learner.\n• Highly organized.\n• Strong initiative.\n• Team player with ability to work on your own.\n• Passionate hands on approach.\n\nNice to Haves\n• Experience in CAD tools such as SolidWorks.\n• Relevant employment experience.\n\nPhysical Job Requirements\n\nThe above statements are intended to describe the general nature and level of work being performed by employees assigned to this position, but they are not an exhaustive list of all the required responsibilities and skills of this position. \n\nBenefits &amp; Compensation\n\nMedtronic offers a competitive Salary and flexible Benefits Package\n\nA commitment to our employees lives at the core of our values. We recognize their contributions. They share in the success they help to create. We offer a wide range of benefits, resources, and competitive compensation plans designed to support you at every career and life stage.\n\nAbout Medtronic\n\nWe lead global healthcare technology and boldly attack the most challenging health problems facing humanity by searching out and finding solutions.\n\nOur Mission — to alleviate pain, restore health, and extend life — unites a global team of 90,000+ passionate people.\n\nWe are engineers at heart— putting ambitious ideas to work to generate real solutions for real people. From the R&amp;D lab, to the factory floor, to the conference room, every one of us experiments, creates, builds, improves and solves. We have the talent, diverse perspectives, and guts to engineer the extraordinary.\n\nLearn more about our business, mission, and our commitment to diversity here",
            "image": "https://encrypted-tbn0.gstatic.com/images?q=tbn:ANd9GcTf8uaoHOXCFhlQcIUuEdWBZwseLN0UFIZlRIA0&s=0",
            "location": "Haifa, Israel",
            "employmentType": "Full-time",
            "datePosted": "20 hours ago",
            "salaryRange": "",
            "jobProviders": [
                {
                    "jobProvider": "LinkedIn",
                    "url": "https://il.linkedin.com/jobs/view/mechanical-engineering-student-at-medtronic-4027626184?utm_campaign=google_jobs_apply&utm_source=google_jobs_apply&utm_medium=organic"
                }
            ]
        },
        {
            "id": "YWhJcl9uSHFBcG5qd0ZkaEFBQUFBQSUzRCUzRCUzQlN0dWRlbnQlMjBJc3JhZWwlMjAlMjAlM0I=",
            "title": "Planner - Student",
            "company": "CIPIA",
            "description": "Cipia is a global leader in in-cabin monitoring using advanced computer vision AI. We work with automotive manufacturers worldwide to implement our software, which detects driver distraction, drowsiness, dangerous driving actions, cabin occupancy, seatbelt usage, and more. Our market is strongly driven by regulation and safety standards, which are expected to lead to mass adoption.We seek an energetic and well-organized candidate for a flexible student position, to assist our project manager by taking ownership of daily Jira management, which is key for running our development processes. This is a great way to meet the entire team, work with all R&amp;D team members, and learn about quality and related processes in the auto-tech world.",
            "image": "https://encrypted-tbn0.gstatic.com/images?q=tbn:ANd9GcQdHh0qQBH-CG8TMbZ061Z8JuX8RwqoCGQ8wrSz&s=0",
            "location": "Herzliya, Israel",
            "employmentType": "Full-time",
            "datePosted": "23 hours ago",
            "salaryRange": "",
            "jobProviders": [
                {
                    "jobProvider": "Cipia",
                    "url": "https://cipia.com/careers/co/https-cipia-com-careers/28.94A/planner-student/all?utm_campaign=google_jobs_apply&utm_source=google_jobs_apply&utm_medium=organic"
                },
                {
                    "jobProvider": "LinkedIn",
                    "url": "https://il.linkedin.com/jobs/view/planner-student-at-cipia-4026810822?utm_campaign=google_jobs_apply&utm_source=google_jobs_apply&utm_medium=organic"
                },
                {
                    "jobProvider": "Indeed",
                    "url": "https://il.indeed.com/viewjob?jk=4bacbea5082928c6&utm_campaign=google_jobs_apply&utm_source=google_jobs_apply&utm_medium=organic"
                },
                {
                    "jobProvider": "Glassdoor",
                    "url": "https://www.glassdoor.com/job-listing/planner-student-cipla-JV_IC2421073_KO0,15_KE16,21.htm?jl=1009447179445&utm_campaign=google_jobs_apply&utm_source=google_jobs_apply&utm_medium=organic"
                }
            ]
        },
        {
            "id": "cEpfUFFvUkhrZHp1dVVlakFBQUFBQSUzRCUzRCUzQlN0dWRlbnQlMjBJc3JhZWwlMjAlMjAlM0I=",
            "title": "Sales Coordinator- Part Time/ Student Position- Israel",
            "company": "Sungrow Israel",
            "description": "Your duties\n\nWe are seeking a motivated Sales Coordinator to join our team at Sungrow for a student position. You will play a crucial role in supporting our sales and commercial efforts, ensuring smooth operations throughout the sales lifecycle. Your contributions will be vital to our ongoing success and customer satisfaction.\n\nIdeal Candidate: The ideal candidate will possess a proactive approach, excellent multitasking abilities, and a strong orientation towards digital tools. You should be a team player who pays attention to detail and is a fast learner. While not mandatory, commercial experience and a legal background are considered advantageous.\n\nResponsibilities:\n1. Sales Support: Assist the sales team throughout the sales lifecycle, including supporting sales and commercial efforts, handling agreements handover, and managing logistics follow-up with HQ.\n2. Contract Management: Oversee the submission of contracts to C4, ensure the issuance and monitoring of bank guarantees, and... manage insurance issuance.\n3. Financial Tracking: Track payment milestones, collections, and manage Sinosure applications and credit.\n4. Quotation Monitoring: Delivery monitoring and logistics quotation.\n5. Interdepartmental Communication: Facilitate communication with other departments such as sales operations, product management, and project management to ensure seamless operations.\n6. Administrative Support: Provide additional administrative support as needed to ensure smooth and efficient sales processes.\n\nYour profile\n\n• Can-do Approach: You are enthusiastic, proactive, and eager to take on challenges and find solutions.\n• Multitasking Abilities: You can handle multiple tasks and projects simultaneously without compromising on quality or efficiency.\n• Team Player: You work well with others, contribute to team goals, and are willing to support your colleagues.\n• High Digital Orientation: You are proficient with digital tools and platforms and can quickly adapt to new technologies and systems. Excellent office skills including ppt, excel and word.\n• Detail-Oriented: You have a keen eye for detail, ensuring accuracy and thoroughness in all tasks.\n• Fast Learner (Autodidact): You are capable of quickly understanding and mastering new information and skills on your own.\n\nAdvantageous Skills:\n• Commercial Experience: Experience in a commercial or sales role, understanding the dynamics of sales processes and customer interactions.\n• Legal Background: Knowledge or experience in legal matters, especially related to contracts and agreements.\n\nOur offer\n\nThe true topic for this decade Is RENEWABLE ENERGY！\nWe are more than happy to state that not only we are leading this discourse, but we also offer the fitting solutions for it. We have the strongest PV-Inverter R&amp;D there is and became the world`s biggest Inverter\nManufacturer, which we are extremely proud of! And now, for this decade, we are increasing our game, and you might become part of it!\nBesides that, many things await You:\n• Opportunities for Career advancement\n• Bonus payment based on pre-agreed and signed KPI agreements\n• A multinational team awaits You with lots of european and trans European exchange!\n• Possibility for technical and commercial knowledge increasement in regard to string inverters, central inverters, inverter stations including transformer and switch gear and storage solutions\n• Technical and commercial training in our headquarter in Germany and even visits to the big R&amp;D facility in China",
            "image": "",
            "location": "Petah Tikva, Israel",
            "employmentType": "Full-time and Part-time",
            "datePosted": "30 days ago",
            "salaryRange": "",
            "jobProviders": [
                {
                    "jobProvider": "Sungrow Deutschland GmbH",
                    "url": "https://career-europe.sungrowpower.com/offer/sales-coordinator-part-time-student/57ddb051-bc06-4446-b6d7-d6980e01165f?utm_campaign=google_jobs_apply&utm_source=google_jobs_apply&utm_medium=organic"
                },
                {
                    "jobProvider": "LinkedIn",
                    "url": "https://il.linkedin.com/jobs/view/sales-coordinator-part-time-student-position-israel-at-sungrow-europe-4003061732?utm_campaign=google_jobs_apply&utm_source=google_jobs_apply&utm_medium=organic"
                },
                {
                    "jobProvider": "Jobs At Sungrow-EMEA - Personio",
                    "url": "https://sungrow-emea.jobs.personio.de/job/884230?language=en&utm_campaign=google_jobs_apply&utm_source=google_jobs_apply&utm_medium=organic"
                }
            ]
        },
        {
            "id": "bmRETmtFa0xaelNmXzhBRkFBQUFBQSUzRCUzRCUzQlN0dWRlbnQlMjBJc3JhZWwlMjAlMjAlM0I=",
            "title": "Biotechnology student - as a food technologist",
            "company": "Hila Results inc.",
            "description": "An established company in Israel, in the field of meat production, is seeking to\n\nhire an exceptionally talented food technologist\n\nThis company collaborates with leading firms in Israel and has numerous\n\ninternational partnerships.\n\nThe role is intriguing and offers ample challenges.\n\nIt is well-suited for individuals who are led by curiosity, ambition, and interest\n\nin their workplace.\n• This job posting is inclusive and addresses all genders.\n\nAreas of responsibility:\n\nResponsibility for food safety in the factory\n\nConducting internal tests\n\nProfessional responsibility for food production processes\n\nKnowledge of production processes, production technology, responsibility for\n\nfood safety in the field.\n\nA food technologist is required to implement quality and food safety standards\n\nin the field.\n\nCertifying new raw material and packaging suppliers\n\nProviding a response and solutions to technological problems in production\n\nHandling issues related to quality assurance, exceptions... procedures and work\n\ninstructions (HACCP)\n\nImproving processes and prescriptions for efficiency and savings\n\nInitiating, accompanying and managing projects\n\nTraining employees\n\nManaging working relationships with internal and external parties (equipment\n\nsuppliers, customers, etc.)\n\nLeading processes with matrix management\n\nRequired skills:\n\nEducation in the fields of biotechnology/food science/chemistry from a\n\nuniversity or technical college - mandatory\n\nExperience in the field of quality assurance - mandatory\n\nAt least five years of experience in the field - mandatory\n\nWorking in the Ministry of Health - an advantage\n\nSocial skills:\n\n Assertiveness\n\n Ability to distinguish between the important and the insignificant\n\n Ability to lead proactively and not reactively\n\n Ability to work independently and in a team\n\n Analytical thinking, ability to work under pressure, and dedication to the\n\njob\n\n Ability to work with multiple tasks\n\n Independent learning ability and ambition\n\n Excellent interpersonal communication\n\n Very strong human relations and empathy\n\n High level of English\n\n Russian - an advantage\n\nCurious to get more details and arrange a phone interview?\n\nSend your CV to email: hrhilahadar@gmail.com",
            "image": "https://encrypted-tbn0.gstatic.com/images?q=tbn:ANd9GcQ95qKExwnOtniqg-yR9Qe0zFSLvr0y9vPZeRbR&s=0",
            "location": "Rishon LeTsiyon, Israel",
            "employmentType": "Full-time",
            "datePosted": "1 day ago",
            "salaryRange": "",
            "jobProviders": [
                {
                    "jobProvider": "LinkedIn",
                    "url": "https://il.linkedin.com/jobs/view/biotechnology-student-as-a-food-technologist-at-hila-results-inc-4025521705?utm_campaign=google_jobs_apply&utm_source=google_jobs_apply&utm_medium=organic"
                }
            ]
        },
        {
            "id": "MDRPeEIyNHYtSnRpVER4REFBQUFBQSUzRCUzRCUzQlN0dWRlbnQlMjBJc3JhZWwlMjAlMjAlM0I=",
            "title": "Project Manager - Student Position",
            "company": "MyHeritage",
            "description": "MyHeritage is looking for a sharp, data-oriented Project Manager with a strong technical orientation, who will grow the amount of historical record collections on the MyHeritage search engine. This is an excellent opportunity for a student looking to gain experience in data analysis and product development.\n\nAs a Project Manager at MyHeritage, your work will have a direct impact on our millions of users who use our product suite in 42 languages. In this role, you'll be part of the team that owns our ever-expanding historical record database that currently contains more than 20 billion records. You will be in charge of making new historical record collections from all around the world available for search by our users.\n\nYou'll be a part of a dedicated, agile team consisting of project managers and engineers.\n\nResponsibilities:\n• Analyze raw data, find anomalies, and define cleanup and data normalization requirements.\n• Define the user interface of the new historical record collections... on the MyHeritage site.\n• Contribute to the development and enhancement of internal products, tools, and processes.\n\nRequirements:\n• At least 3 semesters left until the completion of your B.Sc. in Computer Science, Industrial Engineering, or a related field — please add your GPA — a must.\n• Knowledge of SQL — a must.\n• Basic scripting/coding skills — an advantage.\n• Fluent written and spoken English — an advantage.\n• Strong technical orientation, including the ability to conduct technical discussion with developers — an advantage.\n• Excellent attention to detail and the ability to be highly organized, creative, and resourceful.\n• Excellent teamwork, communication, and presentation skills.\n• Ability to work in a fast-paced startup environment.\n\nAbout MyHeritage:\n\nMyHeritage is the leading global discovery platform for exploring family history. With billions of historical records and family tree profiles, and with sophisticated matching technologies that work across all its assets, MyHeritage gives users the joy of discovering their past and empowering their future. MyHeritage is the most popular DNA test and family history service in Europe. Since 2020, MyHeritage is also home to the world's most advanced AI technologies for repairing, enhancing, colorizing, and animating historical photos. Learn more at www.myheritage.com. See what it's like to work at MyHeritage on www.glassdoor.com.\n\nBenefits at MyHeritage\n\nOur employees enjoy a range of benefits to enhance work-life balance and well-being:\n• Hybrid work model\n• Modern, beautiful office in Or Yehuda with shuttle service from Tel Aviv and employee parking (for our Or Yehuda employees)\n• On-site gym and pilates classes\n• Dog-friendly office\n• Well-stocked kitchens and a monthly meal allowance\n• Fully funded supplemental health insurance",
            "image": "https://encrypted-tbn0.gstatic.com/images?q=tbn:ANd9GcTkzx1Zp1WxbYM0C3Ms3mdn1OTAD5-i58g-hFix&s=0",
            "location": "Tel Aviv District, Israel (+1 other)",
            "employmentType": "Full-time",
            "datePosted": "5 days ago",
            "salaryRange": "",
            "jobProviders": [
                {
                    "jobProvider": "Francisco Partners Job Board",
                    "url": "https://careers.franciscopartners.com/companies/myheritage/jobs/40401845-project-manager-student-position?utm_campaign=google_jobs_apply&utm_source=google_jobs_apply&utm_medium=organic"
                },
                {
                    "jobProvider": "Glassdoor",
                    "url": "https://fr.glassdoor.ca/job-listing/project-manager-student-position-myheritage-JV_IC2421083_KO0,32_KE33,43.htm?jl=1009444175736&utm_campaign=google_jobs_apply&utm_source=google_jobs_apply&utm_medium=organic"
                },
                {
                    "jobProvider": "Companies | LHH Job Board - LHH Israel",
                    "url": "https://jobs.lhh.co.il/companies/myheritage/jobs/40401845-project-manager-student-position?utm_campaign=google_jobs_apply&utm_source=google_jobs_apply&utm_medium=organic"
                },
                {
                    "jobProvider": "Jobs | Index Ventures Job Board",
                    "url": "https://indexventures.getro.com/companies/myheritage/jobs/40401845-project-manager-student-position?utm_campaign=google_jobs_apply&utm_source=google_jobs_apply&utm_medium=organic"
                },
                {
                    "jobProvider": "Broxer",
                    "url": "https://broxer.com/job/5135581115/?utm_campaign=google_jobs_apply&utm_source=google_jobs_apply&utm_medium=organic"
                }
            ]
        },
        {
            "id": "Z0JsRGZzWWNxWWNieFNCa0FBQUFBQSUzRCUzRCUzQlN0dWRlbnQlMjBJc3JhZWwlMjAlMjAlM0I=",
            "title": "Mechanical Engineering Student",
            "company": "Medtronic",
            "description": "Description\n\nAt Medtronic, you can embark on a lifelong career of exploration and innovation while championing healthcare access and equity for all. You will lead with purpose, breaking down barriers to innovation in a more connected and compassionate world. As part of the R&amp;D mechanical engineering team, you will be responsible for developing surgical platforms and supporting various engineering projects.\n\nCompensation and Benefits\n• Competitive salary and flexible benefits package\n• Recognition of employee contributions\n• Wide range of benefits designed to support you at every career and life stage\n• Opportunities for professional development and career growth\n\nWhy you should apply for this position today\n\nThis life-changing career allows you to build a better future while amplifying your impact on the causes that matter to you and the world. You will connect to a dynamic and inclusive culture that welcomes the challenge of lifelong learning.\n\nSkills\n• Currently pursuing a... bachelor’s degree in mechanical engineering with at least 3 semesters remaining\n• Availability for at least 2 full working days during the semester at the Caesarea office\n• Strong English written and verbal communication skills\n• In-depth experience with Microsoft Office tools: Word, PowerPoint, Excel\n• Self-learner with strong organizational skills\n• Strong initiative and ability to work both independently and in a team\n• Passionate hands-on approach\n\nResponsibilities\n• Be a part of the R&amp;D mechanical engineering team developing surgical platforms\n• Design, run, and document design-supporting tests according to company standards\n• Support R&amp;D lab activities, including system maintenance and troubleshooting\n• Write technical documentation such as component specifications and test results\n• Collaborate with engineers on design projects and provide CAD assistance\n• Conduct technical data analysis and support data-driven decision-making\n• Work physically from our offices in Caesarea\n\nQualifications\n• Student for a bachelor’s degree in mechanical engineering\n• At least 3 semesters remaining in your degree program\n• Experience in CAD tools such as SolidWorks is a plus\n• Previous relevant employment experience is desirable\n\nEducation Requirements\n• Bachelor’s degree in Mechanical Engineering (currently pursuing)\n\nEducation Requirements Credential Category\n• Undergraduate Student\n\nExperience Requirements\n• Relevant experience in mechanical engineering or related fields is a plus\n\nWhy work in Caesarea, Isr\n\nCaesarea is a beautiful coastal city that combines rich history with modern innovation. Working here means being part of a vibrant community with access to stunning beaches, cultural sites, and a dynamic work environment. The city fosters a collaborative spirit and is home to numerous opportunities in technology and healthcare, making it an ideal place to grow your career",
            "image": "https://encrypted-tbn0.gstatic.com/images?q=tbn:ANd9GcTNDd6GhngjRtISF73zG8W8XWU7lRSDBHVfObzp&s=0",
            "location": "Caesarea, Israel",
            "employmentType": "Full-time",
            "datePosted": "11 hours ago",
            "salaryRange": "",
            "jobProviders": [
                {
                    "jobProvider": "Get.It",
                    "url": "https://www.get.it/job/mechanical-engineering-student-in-caesarea-isr-at-medtronic-ga_531860774298189871?utm_campaign=google_jobs_apply&utm_source=google_jobs_apply&utm_medium=organic"
                }
            ]
        },
        {
            "id": "OWhGanFhSWlYbU1vc1AtdEFBQUFBQSUzRCUzRCUzQlN0dWRlbnQlMjBJc3JhZWwlMjAlMjAlM0I=",
            "title": "Customer Support Student position (Part Time)",
            "company": "Connecteam",
            "description": "Location: Tel Aviv, Israel\n\nAbout The Company\nConnecteam is a fast-growing startup that is on a mission to change the deskless work experience. With over 2.7B deskless workers across the globe, the challenges and capabilities for advancement are endless. We are growing our team and are looking for talented, passionate, and driven Support Representatives to join our team based in TLV.\nJoin us to help shape the future of work!\n\nJob Summary\nWe’re seeking ambitious students, with 3 semesters (not including summer semesters) left in their studies, who want to hit the ground running. This is a unique opportunity to jumpstart your career in high-tech at one of the most successful and thriving companies in Israel.\nAs a student, you are part of a team that is dedicated to effectively communicating with our clients. You are responsible for ensuring that they are utilizing the app in the best way possible and helping them solve day-to-day problems while enhancing customer satisfaction. During... your day-to-day, you will take on client's calls, review incoming tickets and prioritize effectively to ensure clients get the very best service.\nMoreover, you will be in touch with our product teams, R&amp;D department, customer success department, and sales teams as we believe you can help us better understand our clients’ needs and improve the product as a result.\n\nResponsibilities\n• You are the face of the company so you will need to quickly and effectively assess customers’ needs\n• You are a customer consultant regardless of industry or location and you should know their business inside and out\n• Deliver a fast response while maintaining high customer satisfaction\n• Provide live feedback to the customer success team\n• Gather data and information from our clients to improve the product\n\nRequirements\n• Excellent English skills (Native verbal and writing is preferred)\n• You’re open-minded, transparent, and trustworthy with a zero-ego\n• A team player that enjoys getting and providing feedback, sharing ideas, and constantly improving together\n• Availability to work in shifts, between 3-4 shifts a week (Sunday to Sunday, 06:00-10:00/ 09:00-17:00/ 14:00-21:00/17:00-00:00/22:00-03:00)\n• BA student (3 semesters left until graduation) or a master's degree student (2 semesters left until graduation). (Graduate by the end of 2025).\n• Strong analytical skills including the ability to work with different software programs and learn new technical skills\n• Start-up mentality\n• Good energy!\n\nAdditionally, the job requires fluency in Hebrew - reading, speaking, and writing\n\nWhat We Offer\n• Flexible shifts for students, working both from the office and from home\n• Gain valuable professional experience\n• Career opportunities for graduates\n\nThe best company culture you’ll ever experience",
            "image": "https://encrypted-tbn0.gstatic.com/images?q=tbn:ANd9GcThFu4PMi5K16GABtgrC0NQnrdB6Pmx3YR1uqEm&s=0",
            "location": "Tel Aviv-Yafo, Israel",
            "employmentType": "Part-time",
            "datePosted": "7 days ago",
            "salaryRange": "",
            "jobProviders": [
                {
                    "jobProvider": "Connecteam",
                    "url": "https://connecteam.com/careers/?gh_jid=5317619004&utm_campaign=google_jobs_apply&utm_source=google_jobs_apply&utm_medium=organic"
                },
                {
                    "jobProvider": "LinkedIn",
                    "url": "https://il.linkedin.com/jobs/view/customer-support-student-position-part-time-at-connecteam-4023048784?utm_campaign=google_jobs_apply&utm_source=google_jobs_apply&utm_medium=organic"
                },
                {
                    "jobProvider": "Built In",
                    "url": "https://builtin.com/job/customer-support-student-position-part-time/3254302?utm_campaign=google_jobs_apply&utm_source=google_jobs_apply&utm_medium=organic"
                }
            ]
        },
        {
            "id": "b3loTDRQYmRrYU0yTDVRSEFBQUFBQSUzRCUzRCUzQlN0dWRlbnQlMjBJc3JhZWwlMjAlMjAlM0I=",
            "title": "Qualified Teaching Tutor",
            "company": "Class-A הוראה פרטית מקצועית",
            "description": "Class A - Innovative Private Tutoring\n\nLocation: Israel\n\nClass A, a leading private tutoring company, is looking for highly skilled and dedicated tutors to join our fast-growing team. Our mission is to bridge the gap between learning challenges and academic success by providing personalized, high-quality tutoring tailored to each student's needs.\n\nWe are seeking tutors for elementary through high school levels in Central Israel in the following subjects:\n• Remedial teaching\n• Mathematics\n• English\n• Chemistry\n• Physics\n• Hebrew\n\nAt Class A, we provide personalized and high-quality tutoring tailored to the unique needs of each student. Our mission is to bridge learning gaps and support students in achieving academic success.\n\nResponsibilities:\n• Provide one-on-one lessons at the student’s home.\n• Develop personalized learning plans for each student.\n• Adapt teaching methods to suit the student’s individual learning style.\n• Track the student's progress and adjust the learning plan... accordingly.\n• Work collaboratively with the Class A team to ensure the best possible learning outcomes.\n\nRequirements:\n• Relevant academic degree or current student in a related field.\n• Proficiency in Hebrew.\n• Flexible schedule to meet students' needs.\n• Strong teaching and communication skills.\n• Passion for education and willingness to build or advance a career in teaching.\n\nIf you are passionate about education and want to help students from elementary to high school succeed, we encourage you to apply and join our mission at Class A.\n\nWe look forward to hearing from you!\n\n---------------------------------------------------------------------------\n\nClass A - הוראה פרטית חדשנית\n\nמיקום: ישראל\n\nקלאס איי, חברת הוראה פרטית מובילה, מחפשת מורים פרטיים מיומנים ומסורים להצטרף לצוות שלנו. המטרה שלנו היא לגשר על פערי למידה ולהוביל את התלמידים להצלחה אקדמית באמצעות הוראה פרטית מותאמת אישית ואיכותית, לפי הצרכים הייחודיים של כל תלמיד.\n\nאנו מחפשים מורים לתלמידי בית ספר יסודי ועד תיכון באזור המרכז במקצועות הבאים:\n• הוראה מתקנת\n• מתמטיקה\n• אנגלית\n• כימיה\n• פיזיקה\n• לשון\n\nתחומי אחריות:\n• העברת שיעורים פרטיים פרונטליים בבית התלמיד.\n• פיתוח תוכניות לימוד מותאמות אישית בהתבסס על התקדמות וצרכי התלמיד.\n• התאמת שיטות ההוראה לסגנון הלמידה הייחודי של כל תלמיד.\n• מעקב אחר התקדמות והתאמת תוכניות הלימוד לשיפור מתמשך.\n• עבודה בשיתוף פעולה עם צוות קלאס איי להבטחת תוצאות לימודיות מיטביות.\n\nדרישות:\n• תואר אקדמי רלוונטי או לימודים פעילים בתחום מתאים.\n• שליטה מלאה בעברית.\n• זמינות וגמישות בשעות כדי להתאים לצרכי התלמידים.\n• כישורי הוראה ותקשורת מצוינים.\n• תשוקה לחינוך ורצון לפתח או לקדם קריירה בתחום ההוראה.\n\nאם אתם נלהבים מחינוך ורוצים לעזור לתלמידים שלנו להצליח, אנו מעודדים אתכם להגיש מועמדות ולהצטרף למשימה שלנו בקלאס איי.\n\nנשמח לשמוע מכם",
            "image": "",
            "location": "Tel Aviv-Yafo, Israel",
            "employmentType": "Contractor",
            "datePosted": "9 hours ago",
            "salaryRange": "",
            "jobProviders": [
                {
                    "jobProvider": "LinkedIn",
                    "url": "https://il.linkedin.com/jobs/view/qualified-teaching-tutor-at-class-a-%D7%94%D7%95%D7%A8%D7%90%D7%94-%D7%A4%D7%A8%D7%98%D7%99%D7%AA-%D7%9E%D7%A7%D7%A6%D7%95%D7%A2%D7%99%D7%AA-4025792728?utm_campaign=google_jobs_apply&utm_source=google_jobs_apply&utm_medium=organic"
                }
            ]
        }
    ],
    "index": 0,
    "jobCount": 10,
    "hasError": false,
    "errors": []
}